In [ ]:
# import the packages
from sqlalchemy import create_engine
import sqlite3

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# create database
# connect to an SQllite database named "testDB.db"
# if db doesn't exist, SQLlite will create it
database_path = "/content/drive/MyDrive/db/testDB.db"
conn = sqlite3.connect(database_path)
cursor = conn.cursor()

In [ ]:
# create the new table called "Products"
create_table_query = """
CREATE TABLE IF NOT EXISTS Products (
  ProductID INTEGER PRIMARY KEY,
  ProductName TEXT NOT NULL,
  SupplierID INTEGER NOT NULL,
  CategoryID INTEGER NOT NULL,
  Unit TEXT NOT NULL,
  Price INTEGER
);
"""

cursor.execute(create_table_query)
conn.commit() #commit the changes
conn.close()

In [ ]:
# load the sql extension
%load_ext sql

In [ ]:
# connecting to the database using SQL magic for further operations
%sql sqlite:////content/drive/MyDrive/db/testDB.db

In [ ]:
#insert the values int othe newly created table
%%sql
INSERT INTO Products (ProductID, ProductName, SupplierID, CategoryID, Unit, Price) VALUES
(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
(2, 'Chang', 1, 1, '24 - 12 ox bottles', 19),
(3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
(4, 'Chef Anton''s Cajun Season', 2, 2, '48 - 6 oz jars', 22),
(5, 'Chef Anton''s Gumbo Mix', 2, 2, '36 boxes', 21.35 );

 * sqlite:////content/drive/MyDrive/db/testDB.db
5 rows affected.

[]

In [ ]:
# view the new table with values
%%sql
SELECT *
FROM Products;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 ox bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Season", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35)]

In [ ]:
%%sql
-- Find average price of all products
-- 18.07
SELECT AVG(Price)
FROM Products;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(18.07,)]

In [ ]:
%%sql
-- find the average proce of products in category 2
-- 17.78
SELECT AVG(Price)
FROM Products
WHERE CategoryID = 2;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(17.783333333333335,)]

In [ ]:
%%sql
-- find the total number of products in the products table
--doesn't ignore null values in a row, 5 producgts in the products table
SELECT COUNT(*)
FROM Products;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(5,)]

In [ ]:
%%sql
-- find the number of products were price in >= 19
-- doesn't ignore null, 3 products
SELECT COUNT(ProductID)
FROM Products
WHERE Price >= 19;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(3,)]

In [ ]:
%%sql
-- what is the lowest price, 10
SELECT MIN(Price)
FROM Products;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(10,)]

In [ ]:
%%sql
-- what is the total price of all the items in the products table, 90.35
SELECT SUM(Price)
FROM Products;

 * sqlite:////content/drive/MyDrive/db/testDB.db
Done.

[(90.35,)]